# ShowDialog Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IRevisionsOnSheetUIServer..::..ShowDialog Method
IRevisionsOnSheetUIServer Interface See Also
---
Shows dialog on managing RevisionsOnSheetUI.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
bool ShowDialog(
	RevisionsOnSheetUIServiceData data
)
```

Visual Basic
---
```text
Function ShowDialog ( _
	data As RevisionsOnSheetUIServiceData _
) As Boolean
```

Visual C++
---
```text
bool ShowDialog(
	RevisionsOnSheetUIServiceData^ data
)
```

# ### Parameters
data
    Type: Autodesk.Revit.UI..::..RevisionsOnSheetUIServiceData The data on initializing the dialog as well as getting the result.
# ### Return Value
Whether or not the dialog launches successfully
# See Also
IRevisionsOnSheetUIServer Interface
Autodesk.Revit.UI Namespace